using MySql.Data.MySqlClient;
using System;
using System.Collections.Generic;
using System.Data;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace PassManager
{
    /// <summary>
    /// Логика взаимодействия для AddCVC.xaml
    /// </summary>
    public partial class AddCVC : Window
    {
        public AddCVC()
        {
            InitializeComponent();
            ShowData();
        }
        Crypt crypt = new Crypt();
        DataTable dt_user = new DataTable();
        string sqlcmd;

        private void button_Click(object sender, RoutedEventArgs e)
        {
            Add();
            //ShowData();
        }
        int len;
        private void Add()
        {
            dt_user = new DataTable();
            string a;
            #region CVC/CVV
            /*sqlcmd = $@"INSERT INTO `CVC/CVV`
                             (`CVC_CVV`)
                             VALUES
                             "
            ;
            for (int i = 0; i < 10; i++)
            {
                a = "00" + i;//.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            for (int i = 10; i < 100; i++)
            {
                a = "0" + i;//.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            for (int i = 100; i < 1000; i++)
            {
                a = i.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            sqlcmd = sqlcmd.Remove(sqlcmd.Length - 2);
            dt_user = Connect(sqlcmd);
            //ShowData();
            //textBox.Text = Convert.ToString(sqlcmd);
            */
            #endregion

            sqlcmd = "";

            #region Pin
            /*
            sqlcmd = $@"INSERT INTO `Pin`
                             (`Пин-код`)
                             VALUES
                             "
            ;
            for (int i = 0; i < 10; i++)
            {
                a = "000" + i;//.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            for (int i = 10; i < 100; i++)
            {
                a = "00" + i;//.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            for (int i = 100; i < 1000; i++)
            {
                a = "0" + i.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            for (int i = 1000; i < 10000; i++)
            {
                a = i.ToString();
                a = crypt.Encode(a, Crypt.key);
                sqlcmd += $"('{a}'),\n";
            }
            sqlcmd = sqlcmd.Remove(sqlcmd.Length - 2);
            dt_user = new DataTable();
            dt_user = Connect(sqlcmd);
            //ShowData();
            */
            #endregion

            sqlcmd = "";

            #region Card type
            /*sqlcmd = $@"INSERT INTO `Card type`
                             (`Тип карты`)
                             VALUES
                             "
            ;
            a = "Дебетовая (Расчётная)";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Кредитная";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Виртуальная";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Рассрочка";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Предоплаченная";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Корпоративная";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Овердрафтная";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}'),\n";
            a = "Другая";
            a = crypt.Encode(a, Crypt.key);
            sqlcmd += $"('{a}')";

            dt_user = new DataTable();
            dt_user = Connect(sqlcmd);*/
            //ShowData();
            #endregion

            string[] banks = new string[] 
            {"Сбер (СберБанк)",
             "ВТБ",
             "Газпромбанк",
             "Альфа-Банк",
             "Россельхозбанк",
             "ПСБ (ПромСвязьБанк)",
             "МКБ (Московский Кредитный Банк)",
             "Банк «Открытие»",
             "Совкомбанк",
             "Райффайзенбанк",
             "Росбанк",
             "Банк Россия",
             "Тинькофф Банк",
             "ЮниКредит Банк",
             "ВБРР (Всероссийский Банк Развития Реигионов)",
             "Банк ДОМ.РФ",
             "Банк «Санкт-Петербург»",
             "СМП Банк",
             "Ситибанк",
             "Новикомбанк",
             "Ак Барк Банк",
             "БМ-Банк",
             "Уралсиб",
             "Почта Банк",
             "Московский областной банк",
             "Пересвет",
             "РНКБ",
             "Московский Индустриальный Банк",
             "УБРиР",
             "Хоум Кредит Банк",
             "МТС Банк",
             "Русский Стандарт",
             "Банк Зенит",
             "Абсолют Банк",
             "Росэксимбанк",
             "ТрансКапиталБанк",
             "Инвестторгбанк",
             "Сетелем Банк",
             "ВУЗ-Банк",
             "Экспобанк",
             "ОТП Банк",
             "Ренессанс Кредит Банк",
             "РГСБ (Росгосстрах Банк)",
             "Металлинвестбанк",
             "Таврический",
             "Авангард",
             "Аверс",
             "Локо-Банк",
             "АТБ (Азиатско-Тихоокеанский Банк)",
             "Газэнергобанк",
             "Кредит Европа Банк",
             "Кубань Кредит",
             "Дойче Банк (Duetsche Bank)",
             "Центр-Инвест",
             "СКБ-Банк",
             "РН Банк",
             "МСП Банк",
             "Банк Финсервис",
             "ИНГ Банк",
             "ББР Банк",
             "Союз Банк",
             "Бэнк Оф Чайна (Bank of China)",
             "Банк Интеза",
             "Сургутнефтегазбанк",
             "Эм-Ю-Эф-Джи Банк (MUFG Евразия)",
             "Примсоцбанк",
             "Эйч-Эс-Би-Си Банк (HSBC)",
             "Левобережний",
             "Мидзухо Банк (MIZUHO)",
             "Меткомбанк (Каменск-Уральский)",
             "ЦентроКредит",
             "СДМ-Банк",
             "Тойота Банк (TOYOTA)",
             "Солидарность (Самара)",
             "БКВ Банк",
             "БМВ Банк (BMW)",
             "Севергазбанк",
             "Фора_Банк",
             "Аресбанк",
             "Челябинвестбанк",
             "Челиндбанк",
             "СЭБ Банк (SEB)",
             "Генбанк",
             "Объединённый Капитал",
             "КИВИ Банк (QIWI)",
             "Креди Агриколь КИБ",
             "Дальневосточный Банк",
             "ПСКБ (Петербургский Социальный Коммерческий Банк)",
             "Держава",
             "Приморье",
             "МС Банк Рус (MC Bank Rus)",
             "Энерготрансбанк",
             "Фольксваген Банк Рус (VOLKSWAGEN BANK)",
             "Кредит Крал Банк",
             "Балтинвестбанк",
             "Интерпрогрессбанк",
             "Модульбанк",
             "Мерседес-Бенц Банк Рус (Mersedes-Benz)",
             "Татсоцбанк",
             "Ланта-Банк",
             "НС Банк",
             "Ури Банк",
             "АЭБ (Алмазэргиенбанк)",
             "Инбанк",
             "Национальный Стандарт",
             "БыстроБанк",
             "Хлынов",
             "Квант Мобайл Банк (Плюс Банк)",
             "НБД-Банк",
             "Эс-Би-Ай Банк (SBI Bank)",
             "Экономбанк",
             "РосДорБанк",
             "РЕКО Кредит Банк",
             "Урал ФД",
             "Акибанк",
             "Москоммерцбанк",
             "Джей энд Ти Банк (J&T Bank)",
             "Норвик Банк (Вятка Банк)",
             "Углеметбанк",
             "Банк Акцепт",
             "Прио-Внешторгбанк",
             "Энергобанк",
             "Зираат Банк (Ziraat Bank)",
             "НК Банк",
             "Агропромкредит",
             "Реалист Банк (БайкалИнвестБанк)",
             "Кошелев-Банк",
             "ТХБ (Тольяттихимбанк)",
             "Пойдём!",
             "Морской банк",
             "Алеф-Банк",
             "Александровский",
             "ИШБАНК (ISBANK)",
             "Банк Оренбург",
             "БЖФ Банк",
             "Руснарбанк",
             "Национальный Резервный Банк",
             "ККБ (Консервативный Коммерческий Банк)",
             "Датабанк (Ижкомбанк)",
             "НИКО-Банк",
             "Развитие-Столица",
             "ПТБ (ПромТрансБанк)",
             "Банк Раунд (Round Bank)",
             "Саровбизнесбанк",
             "Форштадт",
             "Банк Казани",
             "Банк СКС (Сберегательно-кредитного Сервиса)",
             "ЮГ-Инвестбанк",
             "Автоторгбанк",
             "Нацинвестпромбанк",
             "Гарант-Инвест",
             "Итуруп Банк",
             "РостФинанс",
             "Банк МБА-Москва",
             "Снежинский",
             "Банк Екатеринбург",
             "Новобанк",
             "Банк Финам",
             "Солид Банк",
             "ТПСБанк (Томскпромстройбанк)",
             "Ставропольпромстройбанк",
             "Фридом Финанс (FREEDOM finance)",
             "Хакасский муниципальный банк",
             "Газтрансбанк",
             "Трансстройбанк",
             "Банк БКФ",
             "Сибсоцбанк",
             "Кузнецбизнесбанк",
             "Славия Банк",
             "Агророс Банк",
             "ЧБРР Банк",
             "Кузнецкий Банк",
             "Северный Народный Банк",
             "Белгородсоцбанк",
             "Енисейский Объединённый Банк",
             "Индустриальный Сберегательный Банк",
             "Земский Банк",
             "Роял Кредит Банк",
             "ГорБанк (Петербургский Городской Банк)",
             "Крокус_банк",
             "Автоградбанк",
             "Стройлесбанк",
             "Гута-Банк",
             "Банк Оранжевый",
             "СИАБ Банк (SIAB)",
             "Сити Инвест Банк",
             "Венец Банк",
             "Бланк Банк (BLANC)",
             "Икано Банк (IKANO BANK)",
             "Первоуральскбанк",
             "Нокссбанк",
             "Кремлёвский банк",
             "Синко_Банк",
             "Братский АНКБ",
             "Банк Вологжанин",
             "Москомбанк (Московский Коммерческий Банк)",
             "Санкт-Петербургский Банк Инвестиций",
             "Муниципальный Камчатпрофитбанк",
             "Алтайкапиталбанк",
             "Долинск",
             "Донкомбанк",
             "Кубаньторгбанк",
             "Камский Коммерческий Банк",
             "Далена Банк",
             "Первый Клиентский Банк",
             "Банк Заречье",
             "Москва-Сити Банк",
             "Живаго Банк",
             "Уралпромбанк",
             "Элита Банк",
             "БСТ-Банк",
             "Яринтербанк",
             "Банк Глобус",
             "Профессионал Банк",
             "Кетовский Коммерческий Банк",
             "Внешфинбанк",
             "СМБ (Сельмашбанк)",
             "УралФинанс Банк",
             "АвтоКредитБанк",
             "Юнистрим",
             "Арзамас",
             "Ермак",
             "Русский Банк Сбережений",
             "Первый Дортрансбанк",
             "Йошкар-Ола Банк",
             "Банк Перьм",
             "ИК Банк",
             "КСБ (Костромаселькомбанк)",
             "ТКПБ (Тамбовкредитпроибанк)",
             "ЭКСИ-Банк (АО)",
             "Газнефтьбанк",
             "Национальный Банк Сбережений",
             "Ноосфера",
             "Великие Луки Банк",
             "Приобье Банк",
             "Евроальянс",
             "Банк Саратов",
             "Витабанк",
             "Алтынбанк",
             "Кузбассхимбанк",
             "Примтеркомбанк",
             "Вятич Банк",
             "Калуга Банк",
             "Крона-Банк",
             "Нальчик Банк",
             "Викинг",
             "Вакобанк",
             "Курган Банк",
             "Новокиб Банк",
             "Дружба",
             "Саммит Банк",
             "Почтобанк",
             "ЕАТПБанк",
             "Банк Торжок",
             "Байкалкредобанк",
             "Коммерческий Банк Химик",
             "Балаково-Банк",
             "Дон-Тексбанк",
             "Классик Эконом Банк",
             "МСКБ (Мурманский Социальный Коммерческий Банк)",
             "Славянбанк",
             "Объединённый Банк Республики",
             "НИБ (Народный Инвестиционный Банк)",
             "Земкомбанк",
             "Вайлдберриз Банк (Wildberries, Бак Стандарт-Кредит)",
             "Коммерческий Банк Гефест",
             "Таганрогбанк",
             "МВС Банк",
             "Банк Холмск",
             "Континенталь Банк",
             "СеверСтройБанк",
             "Севзапинвестпромбанк",
             "Коммерческий Банк Тайдон",
             "РНКО Синергия",
             "Тимер Банк",
             "ВЭБ.РФ",
             "ТексБанк",
             "Точка Банк для предпринимателей",
             "Ипотека 24 (Национальная Фабрика Ипотеки)",
             "МегаФон Банк",
             "Российская Финансовая Корпорация",
             "МББ (Мир Бизнес Банк)",
             "БКС Премьер",
             "МосИнвестФинанс",
             "Клюква",
             "Делобанк",
             "Сфера",
             "ЮМани Business",
             "Просто Банк",
             "Хатон",
             "Росбанк Дом",
             "RemiCapital",
             "Финансист",
             "Ренессанс Жизнь",
             "Главпотребкредит",
             "Залог Инвест (ZALOG INVEST)",
             "Банк Непрофильных Активов Траст",
             "Национальный Клиринговый Центр"
            };
            len = banks.Length - 1;
            for (int i = 0; i < banks.Length; i++)
            {
                banks[i] = crypt.Encode(banks[i], Crypt.key);
            }

            dt_user = new DataTable();
            sqlcmd = $@"INSERT INTO `Banks`
                             (`Банк`)
                             VALUES
                                   "
            ;
            for (int i = 0; i < len; i++)
            {
                sqlcmd += $"('{banks[i]}'),\n";
            }
            sqlcmd = sqlcmd.Remove(sqlcmd.Length - 2);
            dt_user = Connect(sqlcmd);
            ShowData();
        }

        private void ShowData()
        {
            dt_user = new DataTable();
            sqlcmd = $@"SELECT * 
                             FROM `Banks`"
            ;
            dt_user = Connect(Data.sqlcmd);

            for (int i = 0; i < dt_user.Rows.Count; i++)
            {
                dt_user.Rows[i][1] = crypt.Decode(dt_user.Rows[i][1].ToString(), Crypt.key);
                comboBox.Items.Add(dt_user.Rows[i][1]);
            }
            dataGrid.ItemsSource = dt_user.DefaultView;
            textBox.Text = dataGrid.Items.Count.ToString();
        }
        private DataTable Connect(string selectSQL)
        {
            dt_user = new DataTable();
            MySqlConnectionStringBuilder connection = new MySqlConnectionStringBuilder()
            {
                Server = "f0586228.xsph.ru",
                Port = 3306,
                Database = "f0586228_test",
                UserID = "f0586228",
                Password = "deuzatihza"
            };

            MySqlConnection conn = new MySqlConnection(connection.ConnectionString);
                conn.Open();
                MySqlCommand sqlCommand = new MySqlCommand(sqlcmd, conn);
                MySqlDataAdapter da = new MySqlDataAdapter(sqlCommand);
                da.Fill(dt_user);
                conn.Close();
            
            return dt_user;
        }
    }
}
